using System;
using System.Collections;
using System.Collections.Generic;
using System.Linq;
using System.Reflection.Emit;
using System.Text;
using System.Threading.Tasks;

namespace RWParcer
{
    public class Parcer
    {
        public static List<Station> GetStation(string input)
        {

            List<Station> stations = [
                new(){ prefix = "ст.", label = "ст. Минск-Пассажирский, г. Минск, Минская обл., Беларусь", label_tail = "г. Минск, Минская обл., Беларусь", value = "Минск-Пассажирский", exp = "2100001", ecp = "140210" },
                new(){ prefix = "ст.", label = "ст. Мир, г. Мир, Гродненская обл., Беларусь", label_tail = "г. Мир, Гродненская обл., Беларусь", value = "Мир", exp = "2100025", ecp = "140211" },
                new(){ prefix = "ст.", label = "ст. Минск, г. Минск, Минская обл., Беларусь", label_tail = "г. Минск, Минская обл., Беларусь", value = "Минск", exp = "2100002", ecp = "140212" },
                new(){ prefix = "ст.", label = "ст. Мииииии, г. Мииииии, Выдуманная обл., Беларусь", label_tail = "г. Мииииии, Выдуманная обл., Беларусь", value = "Мииииии", exp = "2100999", ecp = "999999" },
                new(){ prefix = "ст.", label = "ст. Брест-Центральный, г. Брест, Брестская обл., Беларусь", label_tail = "г. Брест, Брестская обл., Беларусь", value = "Брест-Центральный", exp = "2100012", ecp = "130210" },
                new(){ prefix = "ст.", label = "ст. Гомель, г. Гомель, Гомельская обл., Беларусь", label_tail = "г. Гомель, Гомельская обл., Беларусь", value = "Гомель", exp = "2100033", ecp = "150210" },
                new(){ prefix = "ст.", label = "ст. Витебск, г. Витебск, Витебская обл., Беларусь", label_tail = "г. Витебск, Витебская обл., Беларусь", value = "Витебск", exp = "2100044", ecp = "120210" },
                new(){ prefix = "ст.", label = "ст. Гродно, г. Гродно, Гродненская обл., Беларусь", label_tail = "г. Гродно, Гродненская обл., Беларусь", value = "Гродно", exp = "2100055", ecp = "110210" },
                new(){ prefix = "ст.", label = "ст. Могилев, г. Могилев, Могилевская обл., Беларусь", label_tail = "г. Могилев, Могилевская обл., Беларусь", value = "Могилев", exp = "2100066", ecp = "160210" },
                new(){ prefix = "ст.", label = "ст. Барановичи-Полесские, г. Барановичи, Брестская обл., Беларусь", label_tail = "г. Барановичи, Брестская обл., Беларусь", value = "Барановичи-Полесские", exp = "2100077", ecp = "130211" },
                new(){ prefix = "ст.", label = "ст. Орша-Центральная, г. Орша, Витебская обл., Беларусь", label_tail = "г. Орша, Витебская обл., Беларусь", value = "Орша-Центральная", exp = "2100088", ecp = "120211" },
                new(){ prefix = "ст.", label = "ст. Полоцк, г. Полоцк, Витебская обл., Беларусь", label_tail = "г. Полоцк, Витебская обл., Беларусь", value = "Полоцк", exp = "2100099", ecp = "120212" },
                new(){ prefix = "ст.", label = "ст. Пинск, г. Пинск, Брестская обл., Беларусь", label_tail = "г. Пинск, Брестская обл., Беларусь", value = "Пинск", exp = "2100100", ecp = "130212" },
                new(){ prefix = "ст.", label = "ст. Борисов, г. Борисов, Минская обл., Беларусь", label_tail = "г. Борисов, Минская обл., Беларусь", value = "Борисов", exp = "2100111", ecp = "140215" },
                new(){ prefix = "ст.", label = "ст. Речица, г. Речица, Гомельская обл., Беларусь", label_tail = "г. Речица, Гомельская обл., Беларусь", value = "Речица", exp = "2100195", ecp = "154800" },
                new(){ prefix = "ст.", label = "ст. Светлогорск, г. Светлогорск, Гомельская обл., Беларусь", label_tail = "г. Светлогорск, Гомельская обл., Беларусь", value = "Светлогорск", exp = "2100123", ecp = "150211" },
                new(){ prefix = "ст.", label = "ст. Жлобин, г. Жлобин, Гомельская обл., Беларусь", label_tail = "г. Жлобин, Гомельская обл., Беларусь", value = "Жлобин", exp = "2100134", ecp = "150212" },
                new(){ prefix = "ст.", label = "ст. Калинковичи, г. Калинковичи, Гомельская обл., Беларусь", label_tail = "г. Калинковичи, Гомельская обл., Беларусь", value = "Калинковичи", exp = "2100145", ecp = "150213" },
                new(){ prefix = "ст.", label = "ст. Осиповичи, г. Осиповичи, Могилевская обл., Беларусь", label_tail = "г. Осиповичи, Могилевская обл., Беларусь", value = "Осиповичи", exp = "2100156", ecp = "160211" },
                new(){ prefix = "ст.", label = "ст. Кричев, г. Кричев, Могилевская обл., Беларусь", label_tail = "г. Кричев, Могилевская обл., Беларусь", value = "Кричев", exp = "2100167", ecp = "160212" },
                new(){ prefix = "ст.", label = "ст. Слуцк, г. Слуцк, Минская обл., Беларусь", label_tail = "г. Слуцк, Минская обл., Беларусь", value = "Слуцк", exp = "2100178", ecp = "140216" },
                new(){ prefix = "ст.", label = "ст. Кобрин, г. Кобрин, Брестская обл., Беларусь", label_tail = "г. Кобрин, Брестская обл., Беларусь", value = "Кобрин", exp = "2100189", ecp = "130213" },
                new(){ prefix = "ст.", label = "ст. Мозырь, г. Мозырь, Гомельская обл., Беларусь", label_tail = "г. Мозырь, Гомельская обл., Беларусь", value = "Мозырь", exp = "2100206", ecp = "150214" },
                new(){ prefix = "ст.", label = "ст. Новополоцк, г. Новополоцк, Витебская обл., Беларусь", label_tail = "г. Новополоцк, Витебская обл., Беларусь", value = "Новополоцк", exp = "2100217", ecp = "120213" },
                new(){ prefix = "ст.", label = "ст. Жодино, г. Жодино, Минская обл., Беларусь", label_tail = "г. Жодино, Минская обл., Беларусь", value = "Жодино", exp = "2100228", ecp = "140217" },
                new(){ prefix = "ст.", label = "ст. Малорита, г. Малорита, Брестская обл., Беларусь", label_tail = "г. Малорита, Брестская обл., Беларусь", value = "Малорита", exp = "2100239", ecp = "130214" },
                new(){ prefix = "ст.", label = "ст. Березино, г. Березино, Минская обл., Беларусь", label_tail = "г. Березино, Минская обл., Беларусь", value = "Березино", exp = "2100240", ecp = "140218" },
                new(){ prefix = "ст.", label = "ст. Дзержинск, г. Дзержинск, Минская обл., Беларусь", label_tail = "г. Дзержинск, Минская обл., Беларусь", value = "Дзержинск", exp = "2100251", ecp = "140219" },
                new(){ prefix = "ст.", label = "ст. Столбцы, г. Столбцы, Минская обл., Беларусь", label_tail = "г. Столбцы, Минская обл., Беларусь", value = "Столбцы", exp = "2100262", ecp = "140220" },
                new(){ prefix = "ст.", label = "ст. Ивацевичи, г. Ивацевичи, Брестская обл., Беларусь", label_tail = "г. Ивацевичи, Брестская обл., Беларусь", value = "Ивацевичи", exp = "2100273", ecp = "130215" },
                new(){ prefix = "ст.", label = "ст. Клецк, г. Клецк, Минская обл., Беларусь", label_tail = "г. Клецк, Минская обл., Беларусь", value = "Клецк", exp = "2100284", ecp = "140221" },
                new(){ prefix = "ст.", label = "ст. Несвиж, г. Несвиж, Минская обл., Беларусь", label_tail = "г. Несвиж, Минская обл., Беларусь", value = "Несвиж", exp = "2100295", ecp = "140222" },
                new(){ prefix = "ст.", label = "ст. Марьина Горка, г. Марьина Горка, Минская обл., Беларусь", label_tail = "г. Марьина Горка, Минская обл., Беларусь", value = "Марьина Горка", exp = "2100306", ecp = "140223" },
                new(){ prefix = "ст.", label = "ст. Червень, г. Червень, Минская обл., Беларусь", label_tail = "г. Червень, Минская обл., Беларусь", value = "Червень", exp = "2100317", ecp = "140224" },
                new(){ prefix = "ст.", label = "ст. Воложин, г. Воложин, Минская обл., Беларусь", label_tail = "г. Воложин, Минская обл., Беларусь", value = "Воложин", exp = "2100328", ecp = "140225" },
                new(){ prefix = "ст.", label = "ст. Мядель, г. Мядель, Минская обл., Беларусь", label_tail = "г. Мядель, Минская обл., Беларусь", value = "Мядель", exp = "2100339", ecp = "140226" },
                new(){ prefix = "ст.", label = "ст. Ошмяны, г. Ошмяны, Гродненская обл., Беларусь", label_tail = "г. Ошмяны, Гродненская обл., Беларусь", value = "Ошмяны", exp = "2100340", ecp = "110211" },
                new(){ prefix = "ст.", label = "ст. Сморгонь, г. Сморгонь, Гродненская обл., Беларусь", label_tail = "г. Сморгонь, Гродненская обл., Беларусь", value = "Сморгонь", exp = "2100351", ecp = "110212" },
                new(){ prefix = "ст.", label = "ст. Новогрудок, г. Новогрудок, Гродненская обл., Беларусь", label_tail = "г. Новогрудок, Гродненская обл., Беларусь", value = "Новогрудок", exp = "2100362", ecp = "110213" },
                new(){ prefix = "ст.", label = "ст. Скидель, г. Скидель, Гродненская обл., Беларусь", label_tail = "г. Скидель, Гродненская обл., Беларусь", value = "Скидель", exp = "2100373", ecp = "110214" },
                new(){ prefix = "ст.", label = "ст. Березовка, г. Березовка, Гродненская обл., Беларусь", label_tail = "г. Березовка, Гродненская обл., Беларусь", value = "Березовка", exp = "2100384", ecp = "110215" },
                new(){ prefix = "ст.", label = "ст. Каменец, г. Каменец, Брестская обл., Беларусь", label_tail = "г. Каменец, Брестская обл., Беларусь", value = "Каменец", exp = "2100395", ecp = "130216" },
                new(){ prefix = "ст.", label = "ст. Хойники, г. Хойники, Гомельская обл., Беларусь", label_tail = "г. Хойники, Гомельская обл., Беларусь", value = "Хойники", exp = "2100406", ecp = "150215" },
                new(){ prefix = "ст.", label = "ст. Лунинец, г. Лунинец, Брестская обл., Беларусь", label_tail = "г. Лунинец, Брестская обл., Беларусь", value = "Лунинец", exp = "2100417", ecp = "130217" },
                new(){ prefix = "ст.", label = "ст. Дрогичин, г. Дрогичин, Брестская обл., Беларусь", label_tail = "г. Дрогичин, Брестская обл., Беларусь", value = "Дрогичин", exp = "2100428", ecp = "130218" },

            ];
            return [.. stations.Where(s =>
                        s.label.Equals(input, StringComparison.OrdinalIgnoreCase) ||
                        s.value.StartsWith(input, StringComparison.OrdinalIgnoreCase))];
        }

        public static List<string> GetTimes(Route r)
        {
            return ["12.00", "13.00"];
            //return ["12.00"];
        }
    }
}
//https://pass.rw.by/ru/ajax/autocomplete/search/?term=абв


//"Минск-Пассажирский",
//            "Мир",
//            "Минск",
//            "Мииииии",
//            "Брест-Центральный",
//            "Гомель",
//            "Витебск",
//            "Гродно",
//            "Могилев",
//            "Барановичи-Полесские",
//            "Орша-Центральная",
//            "Полоцк",
//            "Пинск",
//            "Борисов",
//            "Лида",
//            "Солигорск",
//            "Жлобин",
//            "Калинковичи",
//            "Осиповичи",
//            "Кричев",
//            "Слуцк",
//            "Кобрин",
//            "Мозырь",
//            "Новополоцк",
//            "Речица",
//            "Светлогорск",
//            "Жодино",
//            "Малорита",
//            "Березино",
//            "Дзержинск",
//            "Столбцы",
//            "Ивацевичи",
//            "Клецк",
//            "Несвиж",
//            "Марьина Горка",
//            "Червень",
//            "Воложин",
//            "Мядель",
//            "Ошмяны",
//            "Сморгонь",
//            "Новогрудок",
//            "Скидель",
//            "Березовка",
//            "Каменец",
//            "Хойники",
//            "Лунинец",
//            "Дрогичин",
//            "Шклов",
//            "Костюковичи",
//            "Чаусы",
//            "Горки",
//            "Крупки",
//            "Толочин"
